import { Button } from "@/components/ui/button"
import Image from "next/image"
import Footer from "../Footer"

const Claim = () => {
  return (
    <div className="flex flex-col w-full h-fit mx-auto">
      <p className="text-white bg-[#295729] py-2 pl-6">
        หน้าแรก &gt;&gt; เคลมประกัน
      </p>
      <div className="flex flex-col h-fit bg-[#67be4d] px-[34px] items-center">
        <div className=" flex flex-col max-w-[700px] min-w-[200px] w-4/5 sm:py-24">
          <span className="text-[41px] font-Athiti font-[700] text-center leading-[41px] mt-[20px] text-white">
            ติดต่อ
            <br className="sm:hidden" />
            เพื่อขอเคลม
          </span>
          <div className="flex w-full h-[200px] relative overflow-hidden rounded-md mt-[14px]">
            <Image
              src="/registation.svg"
              alt="Picture of the land"
              fill
              className="object-contain"
            />
          </div>
          <span className="text-[16px] font-[700] text-white bg-[#295729] h-[40px] mt-[16px] rounded-md items-center justify-center flex mb-[16px]">
            อ่านแผนประกันและการคุ้มครอง
          </span>
        </div>
      </div>
      <div className="flex flex-col h-fit px-[34px] w-fit mx-auto sm:py-24">
        <div className=" flex flex-col max-w-[700px] my-[24px]">
          <span>
            <span className="text-[20px] font-[700] font-Athiti text-[#295729]">
              เอกสารที่ต้องจัดเตรียม
            </span>
            <br />
            <br />
            <ul className="list-disc">
              <li>สำเนาบัตรประชาชนของผู้เอาประกับภัย จำนวน 1 ฉบับ</li>
              <li>สำเนาทะเบียนบ้านของผู้เอาประกันภัย จำนวน 1 ฉบับ</li>
              <li>สำเนาโฉนดที่ดินของไร่ จำนวน 1 ฉบับ</li>
              <li>หนังสือเรียกร้องความเสียหาย</li>
            </ul>
          </span>
        </div>
        <div className=" flex flex-col max-w-[700px] mb-[24px]">
          <span>
            <span className="text-[20px] font-[700] font-Athiti text-[#295729]">
              ขั้นตอนการดำเนินการ
            </span>
            <br />
            <br />
            <ul className="list-decimal">
              <li>
                หากพบเหตุการณ์อันส่งผลกระทบต่อต้นไม้ภายใต้ประกันโปรดอ่านแผนประกันและการคุ้มครองเพื่อตรวจสอบเงื่อนไขที่เกี่ยวข้องก่อนติดต่อเจ้าหน้าที่
              </li>
              <li>
                ตรวจสอบข้อมูลการครอบครองประกันต้นไม้ ผ่าน Line @guarantree {">"}{" "}
                ประกันต้นไม้ในครอบครองหากข้อมูลไม่ถูกต้อง สามารถติดต่อบริษัทฯ
                ได้ทางเบอร์โทรศัพท์ 02-000-0000 เพื่อประสานเรื่องกับเจ้าหน้าที่
              </li>
              <li>ตรวจสอบข้อมูลและเงื่อนไขการใช้ผลตอบแทนจากประกันต้นไม้</li>
              <li>
                ติดต่อบริษัทฯ ทางเบอร์โทรศัพท์ 02-000-0000
                เพื่อทำเรื่องนัดหมายเจ้าหน้าที่ตรวจสอบและดำเนินการประเมินเงื่อนไขการรับความเสียหายจากพื้นที่จริง
              </li>
              <li>รับผลตอบแทนตามสัญญาประกัน</li>
            </ul>
          </span>
        </div>
        <Button
          className="h-[60px] bg-[#67be4d] hover:bg-[#508b3e] mb-[75px]"
          onClick={() => {
            // call 02-000-0000
            window.open("tel:02-000-0000")
          }}
        >
          <svg
            width="25"
            height="24"
            viewBox="0 0 25 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <g clip-path="url(#clip0_190_41672)">
              <path
                d="M17.9999 24C9.85089 24.229 -4.57511 9.787 2.36189 1.938C2.38689 1.914 3.45389 0.984 3.45389 0.984C4.12356 0.364944 5.00408 0.024539 5.91601 0.032157C6.82795 0.039775 7.70266 0.394843 8.36189 1.025L10.5139 3.343C11.1478 4.00548 11.4984 4.88905 11.4911 5.80592C11.4838 6.72279 11.1192 7.60068 10.4749 8.253L10.0869 8.647C11.2424 11.2059 13.2868 13.2588 15.8409 14.425L16.2519 14.025C16.9185 13.3901 17.8038 13.036 18.7244 13.036C19.645 13.036 20.5303 13.3901 21.1969 14.025L23.4339 16.1C24.0965 16.7473 24.4768 17.63 24.4922 18.5561C24.5075 19.4823 24.1567 20.3771 23.5159 21.046C23.5159 21.046 22.5859 22.112 22.5619 22.137C21.9626 22.734 21.2508 23.2061 20.4677 23.5259C19.6846 23.8457 18.8458 24.0069 17.9999 24ZM4.44989 4.1C-0.409111 10.118 15.1439 24.773 20.4049 20.05C20.4049 20.05 21.3289 18.991 21.3539 18.967C21.4476 18.8732 21.5003 18.7461 21.5003 18.6135C21.5003 18.4809 21.4476 18.3538 21.3539 18.26L19.1159 16.186C18.8159 15.936 18.6469 15.933 18.3689 16.146L17.2329 17.264C17.028 17.4656 16.7695 17.604 16.4881 17.6629C16.2068 17.7218 15.9144 17.6985 15.6459 17.596C13.6505 16.8535 11.8381 15.6906 10.3315 14.1863C8.82493 12.6819 7.65938 10.8713 6.91389 8.877C6.80538 8.60629 6.77815 8.30982 6.83551 8.02388C6.89288 7.73793 7.03236 7.47491 7.23689 7.267L8.34489 6.141C8.39535 6.09618 8.4359 6.04132 8.46394 5.97993C8.49198 5.91854 8.50691 5.85197 8.50775 5.78449C8.5086 5.717 8.49535 5.65008 8.46886 5.58801C8.44236 5.52594 8.40321 5.47008 8.35389 5.424L6.19989 3.106C6.10458 3.02635 5.98244 2.98613 5.85845 2.99356C5.73446 3.001 5.618 3.05553 5.53289 3.146C5.50889 3.171 4.44989 4.1 4.44989 4.1ZM24.4999 9.5C24.497 6.98134 23.4952 4.56667 21.7142 2.7857C19.9332 1.00474 17.5186 0.00291129 14.9999 0C14.6021 0 14.2205 0.158035 13.9392 0.43934C13.6579 0.720644 13.4999 1.10218 13.4999 1.5C13.4999 1.89783 13.6579 2.27936 13.9392 2.56066C14.2205 2.84196 14.6021 3 14.9999 3C16.7231 3.00212 18.3752 3.68762 19.5937 4.90614C20.8123 6.12467 21.4978 7.77674 21.4999 9.5C21.4999 9.89783 21.6579 10.2794 21.9392 10.5607C22.2205 10.842 22.6021 11 22.9999 11C23.3977 11 23.7792 10.842 24.0605 10.5607C24.3419 10.2794 24.4999 9.89783 24.4999 9.5ZM19.4999 9.5C19.4986 8.30693 19.024 7.16311 18.1804 6.31948C17.3368 5.47585 16.193 5.00132 14.9999 5C14.6021 5 14.2205 5.15804 13.9392 5.43934C13.6579 5.72064 13.4999 6.10218 13.4999 6.5C13.4999 6.89783 13.6579 7.27936 13.9392 7.56066C14.2205 7.84197 14.6021 8 14.9999 8C15.3977 8 15.7792 8.15804 16.0605 8.43934C16.3419 8.72064 16.4999 9.10218 16.4999 9.5C16.4999 9.89783 16.6579 10.2794 16.9392 10.5607C17.2205 10.842 17.6021 11 17.9999 11C18.3977 11 18.7792 10.842 19.0605 10.5607C19.3419 10.2794 19.4999 9.89783 19.4999 9.5Z"
                fill="white"
              />
            </g>
            <defs>
              <clipPath id="clip0_190_41672">
                <rect
                  width="24"
                  height="24"
                  fill="white"
                  transform="translate(0.5)"
                />
              </clipPath>
            </defs>
          </svg>
          <span className="font-Athiti ml-[10px] text-[20px]">โทรเลย</span>
        </Button>
      </div>
      <Footer />
    </div>
  )
}

export default Claim
